1.
// toString, valueOf
var a = {}
a.toString() //'[object Object]'


2.
var a = 1;
export { a }
export default a
export var a = 1

3.
// 解释性语言和编译性语言的定义：
// 计算机不能直接理解高级语言，只能直接理解机器语言，所以必须要把高级语言翻译成机器语言，计算机才能执行高级语言编写的程序。
// 翻译的方式有两种，一个是编译，一个是解释。两种方式只是翻译的时间不同。

// 解释性语言的定义：
// 解释性语言的程序不需要编译，在运行程序的时候才翻译，每个语句都是执行的时候才翻译。这样解释性语言每执行一次就需要逐行翻译一次，效率比较低。
// 现代解释性语言通常把源程序编译成中间代码，然后用解释器把中间代码一条条翻译成目标机器代码，一条条执行。

// 独立, 效率高
// 编译性语言的定义：
// 编译性语言写的程序在被执行之前，需要一个专门的编译过程，把程序编译成为机器语言的文件，比如exe文件，以后要运行的话就不用重新翻译了，直接使用编译的结果就行了（exe文件），因为翻译只做了一次，运行时不需要翻译，所以编译型语言的程序执行效率高。

4.
{/* <img src='' onerror='alert(1)'/> */}
// 图片不存在时, 触发

{/* <div onclick='alert(1)'></div> */}
// 原生的事件绑定的时候触发时 执行的表达式, 而不是一个函数的句柄(函数名)

5.
// 当一个行内元素浮动的时候会变成一个块级元素

6.
js加载执行问题